Tekla Open API Reference for Tekla Structures 2025
Localization Properties
The Localization type exposes the following members.
Properties
Name | Description
DefaultLocalizationFile
 The path and name of the default localization file.
DefaultLocalizationPath |  Obsolete.
 The path and directory name where to find localization files.
Language
 Gets or sets the language that is currently used in Tekla Structures.
Top
See Also
Reference
Localization Class
Tekla.Structures.Dialog Namespace